const messages_pack = {};

//
// ─── INIT ───────────────────────────────────────────────────────────────────────
//
messages_pack['th'] = {};
messages_pack['en'] = {};
// ────────────────────────────────────────────────────────────────────────────────

//
// ─── COMMON ─────────────────────────────────────────────────────────────────────
//
messages_pack['th']['sign_in'] = 'เข้าสู่ระบบ';
messages_pack['en']['sign_in'] = 'Sign in';

messages_pack['th']['sign_up'] = 'สมัครสมาชิก';
messages_pack['en']['sign_up'] = 'Sign up';
// ────────────────────────────────────────────────────────────────────────────────

//
// ─── LANDING ────────────────────────────────────────────────────────────────────
//
messages_pack['th']['welcome'] = 'ยินดีต้อนรับเข้าสู่ Scheduralization';
messages_pack['en']['welcome'] = 'Welcome to Scheduralization';
// ────────────────────────────────────────────────────────────────────────────────

export default messages_pack;
